import React from "react";
import AccordionItem from "../AccordionItem/AccordionItem";
import "./accordion.scss";

const accordionItems = [
  {
    title: "Какой тренер лучше?",
    content:
      "Кращий тренер – той, хто допомагає вам досягати ваших цілей і надихає на постійне вдосконалення.",
    id: 1,
  },
  {
    title: "Ще не пізно?",
    content:
      "Ніколи не пізно займатися, навіть якщо вік великий. Головне — ваше бажання і мотивація!",
    id: 2,
  },
  {
    title: "Я можу отримати травму?",
    content:
      "Так, травми можливі, але правильна техніка, підготовка і хороший тренер допоможуть мінімізувати ризики.",
    id: 3,
  },
  {
    title: "Я соромлюся чужого колективу.",
    content:
      "Це нормально, але пам'ятайте, що всі починали з чогось. Колектив може стати підтримкою і допомогти вам розкритися.",
    id: 4,
  },
  {
    title: "Коли чекати на результат від тренувань?",
    content:
      "Перші результати можуть бути помітні вже через кілька тижнів регулярних тренувань, але для значних досягнень зазвичай потрібно кілька місяців.",
    id: 5,
  },
  {
    title: "Яке екіпірування потрібне на перший час?",
    content:
      "На перший час вам потрібні зручний спортивний одяг, захисні рукавиці та капа. Тренер підкаже, що ще може знадобитися.",
    id: 6,
  },
  {
    title: "Як часто потрібно тренуватися новачкам?",
    content:
      "Новачкам рекомендується тренуватися 2-3 рази на тиждень, щоб поступово звикнути до навантажень і уникнути перенапруги.",
    id: 7,
  },
  {
    title: "З якого віку можна починати займатися?",
    content:
      "Займатися можна починати з 5-6 років, але оптимальний вік залежить від фізичної підготовки і інтересу дитини.",
    id: 8,
  },
  {
    title: "Якщо я старше 30 років, чи є сенс займатися?",
    content:
      "Звісно, є сенс! Заняття ММА покращують фізичну форму, здоров'я та підвищують самооцінку незалежно від віку..",
    id: 9,
  },
  {
    title: "На першому тренуванні мене поставлять у спаринг?",
    content:
      "На першому тренуванні спаринг, ймовірно, не буде. Спочатку вам покажуть основні техніки та правила безпеки.",
    id: 10,
  },
];

const Accordion = () => {
  return (
    <div className="accordion">

      {/*Title*/}
      <div className="accordion__title">
      <h4 className="accordion__title-content">
        faq
      </h4>
      </div>

      {/*accordion__inquirer*/}
      <div className="accordion__inquirer">
        {accordionItems.map((item) => (
          <AccordionItem key={item.id} item={item} />
        ))}
      </div>

    </div>
  );
};

export default Accordion;
